# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 458
b = 'Python'
c = 25 * 2 / 36

d = False
print(type(a))
print(type(b))
print(type(c))
print(type(d))


# <class 'int'>
# <class 'str'>
# <class 'float'>
# <class 'bool'>