# зад. 8

# работа с методами множеств

# входные данные: 
#     hike = {
#     'Друг1': ('Рюкзак', 'Палатка', 'Спальник', 'Фонарик'),
#     'Друг2': ('Рюкзак', 'Палатка', 'Котелок', 'Кружка', 'Спички'),
#     'Друг3': ('Рюкзак', 'Палатка', 'Спички', 'Складной стул')
# }

словарь, в словаре кортежи

пересечения 
разность
объединения
код должен расширяться на любое количество друзей

код будет объемный
циклы в циклах, юнион,интерсекшн. 

https://stepik.org/lesson/482377/step/1?unit=473680

1) собрать повторяющиеся и взять из них уникальные (без дубликатов)

грузоподъемность - от пользователя
 