# Вручную создайте список с целыми числами,
# которые повторяются. Получите новый список,
# который содержит уникальные (без повтора) элементы исходного списка.
#
# *Подготовьте два решения, короткое и длинное,
# которое не использует другие коллекции помимо списков.

lst = [2, 58, 5, 5, 8, 98, 4, 5, 2]

print(list(set(lst)))

result = []
for i not in result:
    result.append()
    
    
# lst = [1, 2, 3, 4, 5, 4, 3, 2, 1] 
# result = [] # print(list(set(lst))) 
# for i in lst: 
#   if i not in result: 
#       result.append(i) 
# print(result)