# Создайте вручную список с повторяющимися целыми числами.
# Сформируйте список с порядковыми номерами нечётных
# элементов исходного списка. Нумерация начинается с единицы.

my_list = [2, 5, 3, 3, 3, 2, 5, 10, 11, 12]

result = []

for idx, elem in enumerate(my_list, 1):
    if elem
    
    
    позиция = индекс + 1, т.е. тут мы начинаем с 1, значит 
    выводим в список не индексы, а позиции элементов
    
    my_list = [2, 5, 3, 3, 3, 2, 5, 10, 11, 12] 
    result = [] 
    
    for k, v in enumerate(my_list, 1): 
        if v % 2 != 0: 
            result.append(k) print(result)