# Вспомните какие модули вы уже проходили на курсе.
# Создайте файл, в котором вы импортируете встроенные
# в модуль функции под псевдонимами. (3-7 строк импорта).

from math import degrees as dg, copysign as cp

from math import factorial as fc

from random import sample as sm

print(fc(6))